'''
# 求 100 以内所有素数之和并输出

sum = 0
def is_prime(num):
	for i in range(2, int(num**0.5)+1):
		if num % i == 0:
			return False
	return True  # 这个return放在循环外面！

for i in range(2,100):
	if is_prime(i) == True:
		sum += i
		
print(sum)
'''

# 编程找出N(即小于等于N)的所有素数。
# 输入格式‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬: 输入一个正整数‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬
# 输出格式‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬: 在同一行中从小到大依次输出不大于n的全部素数，
# 每个数字后面一个空格。

def is_prime(n):
    # 判断素数的函数,接收一个正整数为参数，参数是素数时返回True，
	# 否则返回False。减小判定区间，减少循环次数，提升效率
    for i in range(2, int(n**0.5)+1):
        if n % i == 0:
            return False
    return True


def output_prime(number):
    # 接收一个正整数为参数，遍历从0到number之间的所有整数
    # 在一行中输出不大于number的所有素数，每个数字后一个空格，
	# 函数无返回值。
	for i in range(2,number+1):
		if is_prime(i) == True:
			print(i, end=' ')


positive_int = int(input())  
output_prime(positive_int)     
