# 在我国古代的《算经》里有一个著名的不定方程问题：
# 鸡翁一值钱五，鸡母一值钱三，鸡雏三值钱一。
# 百钱买百鸡，问鸡翁、鸡母、鸡雏各几何？

# 5x+3y+z/3=100
# x+y+z=100
# => 7x+4y=100


for x in range(0,int(100/7)+1):
	if (100-7*x)%4 == 0:
		y = (100-7*x)/4
		z = 100-x-y
		print('公鸡:%d' % x, '母鸡:%d' % y, '小鸡:%d' % z)
	else:
		continue
		
print('公鸡:0  母鸡:25  小鸡:75')
print('公鸡:4  母鸡:18  小鸡:78')
print('公鸡:8  母鸡:11  小鸡:81')
print('公鸡:12  母鸡:4  小鸡:84')

'''
for g in range(1,101):
    for m in range (1,101):
        for x in range(1,101):
            if x%3==0:
                if g+m+x==100 and g*5+m*3+x//3==100:
                    print(g, m, x)
'''